{
  "products": {
    "product-1": {
      "name": "DreamQuest Support Windows Computers Bluetooth5-3",
      "description": "High-performance computer support system with Bluetooth 5.3 connectivity for Windows computers.",
      "brand": "DreamQuest",
      "tags": [
        "electronics",
        "computer",
        "support",
        "bluetooth"
      ],
      "category": "electronics"
    },
    "product-2": {
      "name": "Huidun Laptops Computer Business Quad-Core",
      "description": "Business laptop with quad-core processor for professional computing needs.",
      "brand": "Huidun",
      "tags": [
        "electronics",
        "laptop",
        "business",
        "quad-core"
      ],
      "category": "electronics"
    },
    "product-3": {
      "name": "Cordless Robotic Pool Cleaner – 150 Mins Runtime, IPX8 Waterproof, 2200 Sq Ft Coverage, Powerful Automatic Pool Vacuum Robot for In-Ground & Above-Ground Pools, Quick Charging, Dual Brushes",
      "description": "Advanced cordless robotic pool cleaner with 150 minutes runtime and IPX8 waterproof rating for complete pool maintenance.",
      "brand": "Generic",
      "tags": [
        "home",
        "pool",
        "cleaner",
        "robotic"
      ],
      "category": "home"
    },
    "product-4": {
      "name": "WYBOT C2 Vision Cordless Pool Cleaner with Camera, 8-in-1 Pool Vacuum for Inground Pools, Powerful Suction, Ultra-Fine Filter System Pool Robot, Wall Climbing Navigation, Gray",
      "description": "Advanced pool cleaner with camera technology, 8-in-1 functionality, and wall climbing navigation for complete pool cleaning.",
      "brand": "WYBOT",
      "tags": [
        "home",
        "pool",
        "cleaner",
        "camera"
      ],
      "category": "home"
    },
    "product-5": {
      "name": "Apple iPhone 12, 64GB, Black - Fully Unlocked",
      "description": "Apple iPhone 12 with 64GB storage in black color, fully unlocked for use with any carrier.",
      "brand": "Apple",
      "tags": [
        "electronics",
        "smartphone",
        "iphone",
        "unlocked"
      ],
      "category": "electronics"
    },
    "product-6": {
      "name": "Apple iPhone 12 Mini, 64GB, Black - Unlocked",
      "description": "Compact Apple iPhone 12 Mini with 64GB storage in black color, unlocked for any carrier.",
      "brand": "Apple",
      "tags": [
        "electronics",
        "smartphone",
        "iphone",
        "mini"
      ],
      "category": "electronics"
    },
    "product-7": {
      "name": "Ringke Rugged Gear [Oil & Dirt Resistant] Compatible with iPhone 16 Pro Max Case, Prevents Oily Smudges Non-Slip Enhanced Grip Protective Cover Precise Cutouts for Camera - Black",
      "description": "Rugged protective case for iPhone 16 Pro Max with oil and dirt resistance, enhanced grip, and precise camera cutouts.",
      "brand": "Ringke",
      "tags": [
        "electronics",
        "case",
        "iphone",
        "protective"
      ],
      "category": "electronics"
    },
    "product-8": {
      "name": "Kasa Indoor Pan/Tilt Smart Security Camera, 1080p HD Dog-Camera,2.4GHz with Night Vision,Motion Detection for Baby and Pet Monitor, Cloud & SD Card Storage, Works with Alexa& Google Home (EC70), White",
      "description": "Smart security camera with pan/tilt functionality, 1080p HD recording, night vision, and motion detection for home monitoring.",
      "brand": "Kasa",
      "tags": [
        "electronics",
        "security",
        "camera",
        "smart"
      ],
      "category": "electronics"
    },
    "product-9": {
      "name": "Furhaven Waterproof Throw Blanket for Dogs & Indoor Cats, Washable - Shaggy Plush Calming Long Faux Fur & Velvet Dog Blanket - Mist Gray, Extra Large/XL",
      "description": "Waterproof throw blanket for dogs and cats with shaggy plush design, washable and calming for pets.",
      "brand": "Furhaven",
      "tags": [
        "pet",
        "blanket",
        "waterproof",
        "washable"
      ],
      "category": "pet"
    },
    "product-10": {
      "name": "EHEYCIGA Orthopedic Dog Beds Large Sized Dog, Waterproof Memory Foam Pet Bed with Sides, Non-Slip Bottom Large Pet Bed with Washable Removable Cover, Grey",
      "description": "Orthopedic dog bed with memory foam, waterproof design, and removable washable cover for large dogs.",
      "brand": "EHEYCIGA",
      "tags": [
        "pet",
        "dog-bed",
        "orthopedic",
        "memory-foam"
      ],
      "category": "pet"
    },
    "product-11": {
      "name": "IRIS USA Dog Food Storage Container, 30 lbs & 11 lbs Combo, Cat Food Storage Container, Dog Treat Container, Airtight, Stackable, 2-Cup Scoop, Wheels, Easy Mobility, Black",
      "description": "Airtight dog food storage container combo with wheels, stackable design, and included measuring scoop.",
      "brand": "IRIS USA",
      "tags": [
        "pet",
        "food-storage",
        "airtight",
        "stackable"
      ],
      "category": "pet"
    },
    "product-12": {
      "name": "Veken Innovation Award Winner 95oz/2.8L Pet Fountain, Automatic Cat Water Fountain Dog Water Dispenser with Replacement Filters, Gifts for Christmas, Cats, Dogs, Multiple Pets (Grey, Plastic)",
      "description": "Innovation award winning pet fountain with automatic water dispensing, replacement filters, and large capacity for multiple pets.",
      "brand": "Veken",
      "tags": [
        "pet",
        "fountain",
        "water",
        "automatic"
      ],
      "category": "pet"
    },
    "product-13": {
      "name": "Always Full® 9\" Pet Water Bowl and Bottle Pump Bundle, Self-Refilling, Clean Filtered Water, App-Enabled Hydration Monitoring, Easy Upgrade to Wall Unit, Cat and Dog Water Bowls",
      "description": "Smart pet water bowl with self-refilling system, filtered water, app monitoring, and easy wall unit upgrade option.",
      "brand": "Always Full",
      "tags": [
        "pet",
        "water-bowl",
        "smart",
        "filtered"
      ],
      "category": "pet"
    },
    "product-14": {
      "name": "KENNELS & KATS Pet Grooming Gloves | Deshedding Glove for Easy, Mess-Free Grooming | Grooming Mitt for Dogs, Cats, Rabbits & Horses with Long/Short/Curly Hair | Pet Hair Gloves for Pet Hair Removal",
      "description": "Professional pet grooming gloves for easy, mess-free grooming of dogs, cats, rabbits and horses.",
      "brand": "KENNELS & KATS",
      "tags": [
        "pet",
        "grooming",
        "gloves",
        "deshedding"
      ],
      "category": "pet"
    },
    "product-15": {
      "name": "Febreze Odor-Fighting Fabric Refresher Pet Odor Fighter, 16.9oz, Pack of 2",
      "description": "Powerful fabric refresher that eliminates pet odors and leaves fabrics smelling fresh.",
      "brand": "Febreze",
      "tags": [
        "pet",
        "odor",
        "fabric",
        "refresher"
      ],
      "category": "pet"
    },
    "product-16": {
      "name": "KEYHELP Pet Hair Removal Glove for Dogs & Cats, Newly Upgraded Reusable Electrostatic Pet Hair Gloves, Pet Hair Remover Tool for Clothing, Couch, Carpet...",
      "description": "Reusable electrostatic pet hair removal glove for easy cleaning of pet hair from furniture and clothing.",
      "brand": "KEYHELP",
      "tags": [
        "pet",
        "hair-removal",
        "glove",
        "electrostatic"
      ],
      "category": "pet"
    },
    "product-17": {
      "name": "IRIS USA Stackable Dog Food Storage Container with 2 Cup Scoop, 4 Secure Latches, Fits up to 30 lbs, Pet Dry Food Bin, Gasket Seal Lid, BPA Free, Stackable, Easy Measure, Gray/Dark Gray",
      "description": "Airtight dog food storage container with secure latches and measuring scoop for easy feeding.",
      "brand": "IRIS USA",
      "tags": [
        "pet",
        "food-storage",
        "container",
        "airtight"
      ],
      "category": "pet"
    },
    "product-18": {
      "name": "PetSafe ScoopFree Disposable Crystal Cat Litter Tray - Easy Cleaning Box - Refill Tray for Electric Litter Box - Fresh Scent - 4.3 lb Bags - 3 Pack",
      "description": "Disposable crystal cat litter trays for easy cleaning with fresh scent technology.",
      "brand": "PetSafe",
      "tags": [
        "pet",
        "cat",
        "litter",
        "disposable"
      ],
      "category": "pet"
    },
    "product-19": {
      "name": "Best Pet Supplies Interactive Squeaky Dog Chew Toy, Ideal Dog Toys for Chewers, Small, Medium & Large Dogs, and Fetch Lovers - Crinkle Duck (Yellow), Large",
      "description": "Interactive squeaky dog toy with crinkle sounds, perfect for dogs who love to chew and play fetch.",
      "brand": "Best Pet Supplies",
      "tags": [
        "pet",
        "dog",
        "toy",
        "squeaky"
      ],
      "category": "pet"
    },
    "product-20": {
      "name": "URPOWER Dog Car Seat Cover for Pets 100% Waterproof Seat Cover Hammock 600D Heavy Duty Scratch Proof Nonslip Durable Soft Back Seat Covers for Cars Trucks and SUVs",
      "description": "Waterproof car seat cover for dogs with scratch-proof material and non-slip design.",
      "brand": "URPOWER",
      "tags": [
        "pet",
        "car",
        "seat-cover",
        "waterproof"
      ],
      "category": "pet"
    },
    "product-21": {
      "name": "PetLab Co. Probiotics for Dogs, Support Gut Health, Occasional Diarrhea, Digestive Health & Seasonal Allergies - Salmon Flavor - Packaging May Vary - 30 Soft Chews",
      "description": "Probiotic supplements for dogs to support digestive health and gut function with salmon flavor.",
      "brand": "PetLab Co.",
      "tags": [
        "pet",
        "dog",
        "probiotics",
        "health"
      ],
      "category": "pet"
    },
    "product-22": {
      "name": "Pet Honesty Probiotics for Dogs for Occasional Diarrhea & Bowel Support, Digestive Enzymes with Prebiotics for Gut Health for Dogs, Immunity Health & Itch Relief (Duck 90 ct)",
      "description": "Advanced probiotic formula for dogs with digestive enzymes and prebiotics for optimal gut health.",
      "brand": "Pet Honesty",
      "tags": [
        "pet",
        "dog",
        "probiotics",
        "digestive"
      ],
      "category": "pet"
    },
    "product-23": {
      "name": "Ameritex Waterproof Dog Bed Cover Pet Blanket for Furniture Bed Couch Sofa Reversible",
      "description": "Reversible waterproof pet blanket to protect furniture from pet hair and accidents.",
      "brand": "Ameritex",
      "tags": [
        "pet",
        "bed-cover",
        "waterproof",
        "furniture"
      ],
      "category": "pet"
    },
    "product-24": {
      "name": "Ameritex Waterproof Dog Bed Cover Pet Blanket with Anti-Slip Back for Furniture Bed Couch Sofa",
      "description": "Waterproof pet blanket with anti-slip backing to protect furniture and stay in place.",
      "brand": "Ameritex",
      "tags": [
        "pet",
        "bed-cover",
        "waterproof",
        "anti-slip"
      ],
      "category": "pet"
    },
    "product-25": {
      "name": "Ameritex Pet Bed Blanket Reversible 100% Waterproof Velvet Super Soft for Sofa and Bed (52x82 Inches, Light Grey+Grey)",
      "description": "Large reversible waterproof pet blanket with velvet texture for ultimate comfort and protection.",
      "brand": "Ameritex",
      "tags": [
        "pet",
        "blanket",
        "reversible",
        "velvet"
      ],
      "category": "pet"
    },
    "product-26": {
      "name": "Dog Grooming Kit & Dog Hair Vacuum,15000 Pa Powerful Suction, Pet Grooming Vacuum Removes 99% Pet Hair, Includes Clippers, Brush, Nail Trimmer Grinder, Stainless Steel",
      "description": "Complete dog grooming kit with powerful vacuum suction and professional grooming tools.",
      "brand": "Generic",
      "tags": [
        "pet",
        "grooming",
        "vacuum",
        "kit"
      ],
      "category": "pet"
    },
    "product-27": {
      "name": "FurMe ULTRA Pet Grooming Vacuum Kit - Cat & Dog Grooming Kit For Easy Pet Care at Home, Quiet & Safe Dog Hair Remover Machine with Brush, Clipper, Shedding & Cleaner Tools & 4.5L Canister",
      "description": "Ultra pet grooming vacuum kit with large 4.5L canister and quiet operation for home pet care.",
      "brand": "FurMe",
      "tags": [
        "pet",
        "grooming",
        "vacuum",
        "ultra"
      ],
      "category": "pet"
    },
    "product-28": {
      "name": "FurMe Original Pet Grooming Vacuum Kit - Cat & Dog Grooming Kit for Easy Pet Care at Home, Quiet & Safe Dog Hair Remover Machine with Brush, Clipper, Shedding & Cleaner Tools & 1L Canister",
      "description": "Original pet grooming vacuum kit with 1L canister for convenient home pet grooming.",
      "brand": "FurMe",
      "tags": [
        "pet",
        "grooming",
        "vacuum",
        "original"
      ],
      "category": "pet"
    },
    "product-29": {
      "name": "Uproot Clean Pet Groomer Vacuum Kit 7 in 1 - Cat & Dog Grooming Kit with Brush, Detangle, Deshed, Trim, Clean, & Dry Attachments - Complete Cat & Dog Grooming Vacuum for Shedding Pets",
      "description": "7-in-1 pet grooming vacuum kit with multiple attachments for complete pet care.",
      "brand": "Uproot Clean",
      "tags": [
        "pet",
        "grooming",
        "vacuum",
        "7-in-1"
      ],
      "category": "pet"
    },
    "product-30": {
      "name": "oneisall Dog Clipper Low Noise, Dog Grooming Kit with Rechargeable, Pet Shaver Cordless Electric Quiet Hair Clipper Set for Dogs Cats Pets（Gold）",
      "description": "Low noise cordless dog clipper with rechargeable battery for quiet pet grooming.",
      "brand": "oneisall",
      "tags": [
        "pet",
        "clipper",
        "low-noise",
        "cordless"
      ],
      "category": "pet"
    },
    "product-31": {
      "name": "Checkered Makeup Bag, Portable Makeup Bag with Adjustable Partition, Cosmetic Bags for Women Toiletry Travel Organizer Portable Make Up Bags for Christmas Birthday Gifts",
      "description": "Portable makeup bag with adjustable partitions for organized travel and daily use.",
      "brand": "Generic",
      "tags": [
        "beauty",
        "makeup",
        "bag",
        "travel"
      ],
      "category": "beauty"
    },
    "product-32": {
      "name": "Makeup Bag, Cosmetic Bag, Portable Leather Large Checkered Makeup Bag, 2 Pack Large Capacity Travel Cosmetic Bag for Women, Lightweight Design and Waterproof Toilet",
      "description": "2-pack large capacity waterproof makeup bags with leather design for travel and daily use.",
      "brand": "Generic",
      "tags": [
        "beauty",
        "makeup",
        "bag",
        "waterproof"
      ],
      "category": "beauty"
    },
    "product-33": {
      "name": "LIBIHUA Future Mrs,Funny Engagement Gift for Bride-Makeup Bag Cosmetic Bag Travel Pouch,Bride to Be-Newly Engaged-Bridal Shower Present for Her-Bachelorette Party Gifts for Women",
      "description": "Funny engagement gift makeup bag perfect for brides-to-be and bridal shower presents.",
      "brand": "LIBIHUA",
      "tags": [
        "beauty",
        "makeup",
        "bag",
        "gift"
      ],
      "category": "beauty"
    },
    "product-34": {
      "name": "Gifts for Her - Initial Large Makeup Bags, Personalized Double Layer Cosmetic Bags with Makeup Brush Organizer, Waterproof PU Leather Travel Toiletry Bags for Wedding & Bridesmaid Gifts",
      "description": "Personalized makeup bags with initial and makeup brush organizer for special occasions.",
      "brand": "Generic",
      "tags": [
        "beauty",
        "makeup",
        "bag",
        "personalized"
      ],
      "category": "beauty"
    },
    "product-35": {
      "name": "Birthday Gifts for Women Teen Girl, Personalized Initial Makeup Organizer Bag Set, Open Flat Travel Cosmetic Bag With Clear Divider and Handle(Beige,A) Brand: CLOUDWINGS",
      "description": "Personalized makeup organizer bag set with clear dividers and handle for easy organization.",
      "brand": "CLOUDWINGS",
      "tags": [
        "beauty",
        "makeup",
        "organizer",
        "personalized"
      ],
      "category": "beauty"
    },
    "product-36": {
      "name": "Dokotoo Blouses Block Long Sleeve Shirts V Neck Tops",
      "description": "Stylish long sleeve blouses with V-neck design for casual and professional wear.",
      "brand": "Dokotoo",
      "tags": [
        "fashion",
        "blouses",
        "long-sleeve",
        "v-neck"
      ],
      "category": "fashion"
    },
    "product-37": {
      "name": "Micoson Women's Long Sleeve Tops Dressy Casual Fall Clothes Fashion 2025 V Neck Clothing Color Block T Shirts",
      "description": "Fashion 2025 long sleeve tops with color block design for dressy casual wear.",
      "brand": "Micoson",
      "tags": [
        "fashion",
        "tops",
        "long-sleeve",
        "color-block"
      ],
      "category": "fashion"
    },
    "product-38": {
      "name": "Marc Jacobs The Small Tote",
      "description": "Luxury small tote bag from Marc Jacobs for elegant everyday carry.",
      "brand": "Marc Jacobs",
      "tags": [
        "fashion",
        "tote",
        "luxury",
        "handbag"
      ],
      "category": "fashion"
    },
    "product-39": {
      "name": "GRACE KARIN Sequin Tops 3/4 Sleeve Blouse V-Neck Shirts",
      "description": "Elegant sequin tops with 3/4 sleeve and V-neck design for special occasions.",
      "brand": "GRACE KARIN",
      "tags": [
        "fashion",
        "sequin",
        "tops",
        "blouse"
      ],
      "category": "fashion"
    },
    "product-40": {
      "name": "Logitech G502 HERO High Performance Wired Gaming Mouse, HERO 25K Sensor, 25,600 DPI, RGB, Adjustable Weights, 11 Buttons, On-Board Memory, PC/Mac",
      "description": "High-performance gaming mouse with HERO 25K sensor, RGB lighting, and adjustable weights.",
      "brand": "Logitech",
      "tags": [
        "gaming",
        "mouse",
        "hero-sensor",
        "rgb"
      ],
      "category": "gaming"
    },
    "product-41": {
      "name": "TBMPOY Men's Tracksuits Sweatsuits for Men Sweat Track Suits 2 Piece Casual Athletic Jogging Warm Up Full Zip Sets",
      "description": "2-piece men's tracksuit set with full zip for casual athletic wear and jogging.",
      "brand": "TBMPOY",
      "tags": [
        "fashion",
        "men",
        "tracksuit",
        "athletic"
      ],
      "category": "fashion"
    },
    "product-42": {
      "name": "COOFANDY Men's Tracksuits 2 Piece Athletic Track Suit Jogging Running Sweatsuits Casual Warm Full Zip Sports Set",
      "description": "Athletic 2-piece tracksuit for men with full zip design for jogging and running.",
      "brand": "COOFANDY",
      "tags": [
        "fashion",
        "men",
        "tracksuit",
        "sports"
      ],
      "category": "fashion"
    },
    "product-43": {
      "name": "UOUA Men's Tracksuit 2 Piece Sets Casual Sweatsuit with Full Zip Athletic Jogging Suits Waffle Plaid Jacquard Outfits",
      "description": "Casual 2-piece men's tracksuit with waffle plaid jacquard design for athletic wear.",
      "brand": "UOUA",
      "tags": [
        "fashion",
        "men",
        "tracksuit",
        "jacquard"
      ],
      "category": "fashion"
    },
    "product-44": {
      "name": "Men's Tracksuits Sweatsuits 2 Piece Casual Sweat Jogging Suit Set Athletic Full Zip Hoodies and Sweatpant Outfits",
      "description": "2-piece casual sweat jogging suit set with full zip hoodies and sweatpants.",
      "brand": "Generic",
      "tags": [
        "fashion",
        "men",
        "sweatsuit",
        "hoodie"
      ],
      "category": "fashion"
    },
    "product-45": {
      "name": "COOFANDY Men's 2 Piece Tracksuit Set Polo Athletic Sweatsuit Quarter Zip Jogging Long Sleeve Casual Sports Outfits",
      "description": "2-piece tracksuit set with polo design and quarter zip for athletic and casual wear.",
      "brand": "COOFANDY",
      "tags": [
        "fashion",
        "men",
        "tracksuit",
        "polo"
      ],
      "category": "fashion"
    },
    "product-46": {
      "name": "COOFANDY Men's Long Sleeve Henley Shirts Cotton T-Shirts Casual Pullover Shirt Soft Stretch Basic Tees Fall Tops",
      "description": "Long sleeve henley shirts in cotton with soft stretch for casual fall wear.",
      "brand": "COOFANDY",
      "tags": [
        "fashion",
        "men",
        "henley",
        "cotton"
      ],
      "category": "fashion"
    },
    "product-47": {
      "name": "Versace Women's Ve2168 Round",
      "description": "Luxury round sunglasses from Versace for women with elegant design.",
      "brand": "Versace",
      "tags": [
        "fashion",
        "sunglasses",
        "luxury",
        "versace"
      ],
      "category": "fashion"
    },
    "product-48": {
      "name": "Tory Burch TY7143U Sunglasses 170913-56 -, womens, Dk Brown Gradient TY7143U-170913-56",
      "description": "Tory Burch women's sunglasses with dark brown gradient lenses for stylish sun protection.",
      "brand": "Tory Burch",
      "tags": [
        "fashion",
        "sunglasses",
        "tory-burch",
        "gradient"
      ],
      "category": "fashion"
    },
    "product-49": {
      "name": "Versace The Dreamer for Men 3.4 oz Eau de Toilette Spray",
      "description": "Luxury men's fragrance from Versace with 3.4 oz eau de toilette spray.",
      "brand": "Versace",
      "tags": [
        "beauty",
        "fragrance",
        "men",
        "versace"
      ],
      "category": "beauty"
    },
    "product-50": {
      "name": "Versace Men's VE4296 Sunglasses 59mm",
      "description": "Luxury men's sunglasses from Versace with 59mm lens size for premium style.",
      "brand": "Versace",
      "tags": [
        "fashion",
        "sunglasses",
        "men",
        "versace"
      ],
      "category": "fashion"
    },
    "product-51": {
      "name": "Kattee Women's Soft Leather Tote Bag, Top Satchel Purses and Handbags",
      "description": "Soft leather tote bag for women with satchel design for elegant everyday carry.",
      "brand": "Kattee",
      "tags": [
        "fashion",
        "tote",
        "leather",
        "handbag"
      ],
      "category": "fashion"
    },
    "product-52": {
      "name": "sqlp Large Work Tote Bag for Women Designer Purses and Handbags Big Bucket bags Ladies Travel Crossbody Purse",
      "description": "Large work tote bag for women with designer style, perfect for travel and daily use.",
      "brand": "sqlp",
      "tags": [
        "fashion",
        "tote",
        "work",
        "travel"
      ],
      "category": "fashion"
    },
    "product-53": {
      "name": "Motorola Moto G Stylus 5G | 2024 | Unlocked | Made for US 8/256GB | 50MP Camera | Scarlet Wave",
      "description": "Motorola Moto G Stylus 5G smartphone with 8GB RAM, 256GB storage, and 50MP camera.",
      "brand": "Motorola",
      "tags": [
        "electronics",
        "smartphone",
        "5g",
        "stylus"
      ],
      "category": "electronics"
    },
    "product-54": {
      "name": "BOSTANTEN Women's Leather Designer Handbags Tote Purses Shoulder Bucket Bags",
      "description": "Designer leather handbags for women with tote and shoulder bucket bag styles.",
      "brand": "BOSTANTEN",
      "tags": [
        "fashion",
        "handbag",
        "leather",
        "designer"
      ],
      "category": "fashion"
    },
    "product-55": {
      "name": "Sunzel Flare Leggings Crossover Yoga Pants",
      "description": "Flare leggings with crossover design, perfect for yoga and active wear.",
      "brand": "Sunzel",
      "tags": [
        "fashion",
        "leggings",
        "yoga",
        "flare"
      ],
      "category": "fashion"
    },
    "product-56": {
      "name": "BOYATU Travel Makeup Bag Cosmetic Bags for Women: 3 Pcs Set Large Portable Make up Bag with Handle - Vegan Leather Toiletry Bags with Compartments - Makeup Organizer for Travel Essentials(A-1-Coffee)",
      "description": "3-piece travel makeup bag set with vegan leather and compartments for organized travel.",
      "brand": "BOYATU",
      "tags": [
        "beauty",
        "makeup",
        "travel",
        "vegan-leather"
      ],
      "category": "beauty"
    },
    "product-57": {
      "name": "BOYATU Travel Makeup Bag Cosmetic Bags for Women: 3 Pcs Set Portable Make up Bag with Handle - Vegan Leather Toiletry Bags with Compartments - Makeup Organizer for Travel Essentials(C-4-Beige)",
      "description": "3-piece travel makeup bag set in beige with vegan leather and organized compartments.",
      "brand": "BOYATU",
      "tags": [
        "beauty",
        "makeup",
        "travel",
        "beige"
      ],
      "category": "beauty"
    },
    "product-58": {
      "name": "Travel Makeup Bag Women's Large Capacity Cosmetic Portable Organizer Large Opening Waterproof Storage Toiletry Bags Vertical Free-Standing Brush Holder for Easy Access Black",
      "description": "Large capacity waterproof travel makeup bag with vertical brush holder for easy access.",
      "brand": "Generic",
      "tags": [
        "beauty",
        "makeup",
        "travel",
        "waterproof"
      ],
      "category": "beauty"
    },
    "product-59": {
      "name": "Masa Kawa Leather Hanging Travel Toiletry Bag for Men Portable Expandable Camping Cosmetics Makeup Toiletries Organizer Waterproof Bathroom Shaving Kit Black Wash Bags",
      "description": "Leather hanging toiletry bag for men with expandable design and waterproof protection.",
      "brand": "Masa Kawa",
      "tags": [
        "beauty",
        "toiletry",
        "leather",
        "men"
      ],
      "category": "beauty"
    },
    "product-60": {
      "name": "Genuine Leather Toiletry Bag for Men & Women – Large Waterproof Travel Dopp Kit – Handmade Shaving & Cosmetic Organizer – Classic Style Wash Bag for Bathroom, Gym, or Vacation",
      "description": "Handmade genuine leather toiletry bag for men and women with waterproof design.",
      "brand": "Generic",
      "tags": [
        "beauty",
        "toiletry",
        "leather",
        "handmade"
      ],
      "category": "beauty"
    },
    "product-61": {
      "name": "Masa Kawa Leather Hanging Travel Toiletry Bag for Men Portable Expandable Camping Cosmetics Makeup Toiletries Organizer Waterproof Bathroom Shaving Kit Black Wash Bags",
      "description": "Leather hanging toiletry bag for men with expandable design and waterproof protection.",
      "brand": "Masa Kawa",
      "tags": [
        "beauty",
        "toiletry",
        "leather",
        "expandable"
      ],
      "category": "beauty"
    },
    "product-62": {
      "name": "SUUKSESS Women Sexy Mesh Sheer Crop Tank Tops Sleeveless Ruched Going Out Tops",
      "description": "Sexy mesh sheer crop tank tops with sleeveless ruched design for going out.",
      "brand": "SUUKSESS",
      "tags": [
        "fashion",
        "crop-top",
        "mesh",
        "sheer"
      ],
      "category": "fashion"
    },
    "product-63": {
      "name": "RUSTIC TOWN Full Grain Leather Travel Toiletry Bag - Cosmetic Ditty Kit Organizer (Dark Brown)",
      "description": "Full grain leather travel toiletry bag in dark brown for organized travel essentials.",
      "brand": "RUSTIC TOWN",
      "tags": [
        "beauty",
        "toiletry",
        "leather",
        "full-grain"
      ],
      "category": "beauty"
    },
    "product-64": {
      "name": "Nolita Handmade Genuine Buffalo Leather Hanging Toiletry Bag Travel Dopp Kit for Men and Women Crazy Horse Distressed Vintage Brown",
      "description": "Handmade genuine buffalo leather toiletry bag with vintage distressed brown finish.",
      "brand": "Nolita",
      "tags": [
        "beauty",
        "toiletry",
        "buffalo-leather",
        "handmade"
      ],
      "category": "beauty"
    },
    "product-65": {
      "name": "Stroller Rain Cover,Universal Rain Cover for Side by Side Baby Stroller, Double Stroller Cover for Rain and Wind,Baby Outdoor Activities Accessories.",
      "description": "Universal rain cover for side by side baby strollers, providing protection from rain and wind during outdoor activities.",
      "brand": "Generic",
      "tags": [
        "baby",
        "stroller",
        "rain-cover",
        "outdoor"
      ],
      "category": "baby"
    },
    "product-66": {
      "name": "12 Beloved Disney Classic Little Golden Books (Boxed Set)",
      "description": "Boxed set of 12 beloved Disney classic Little Golden Books for children's reading enjoyment.",
      "brand": "Disney",
      "tags": [
        "books",
        "disney",
        "children",
        "classic"
      ],
      "category": "books"
    },
    "product-67": {
      "name": "Dr. Seuss's Beginner Book Boxed Set Collection: The Cat in the Hat; One Fish Two Fish Red Fish Blue Fish; Green Eggs and Ham; Hop on Pop; Fox in Socks Hardcover – Box set",
      "description": "Complete Dr. Seuss beginner book collection with classic stories in a beautiful boxed set.",
      "brand": "Dr. Seuss",
      "tags": [
        "books",
        "dr-seuss",
        "children",
        "classic"
      ],
      "category": "books"
    },
    "product-68": {
      "name": "Leeleberd Led Lights for Bedroom 100 ft (2 Rolls of 50ft) Music Sync Color Changing RGB Led Strip Lights with Remote App Control Bluetooth Led Strip, Lights for Room Home Kitchen Party Decor",
      "description": "100ft RGB LED strip lights with music sync, app control, and Bluetooth connectivity for bedroom and home decoration.",
      "brand": "Leeleberd",
      "tags": [
        "home",
        "led-lights",
        "rgb",
        "bluetooth"
      ],
      "category": "home"
    },
    "product-69": {
      "name": "My First Library: Boxset of 10 Board Books for Kids Board book – April 25, 2018 by Wonder House Books (Author)",
      "description": "Boxset of 10 board books perfect for young children's first library and early learning.",
      "brand": "Wonder House Books",
      "tags": [
        "books",
        "children",
        "board-books",
        "learning"
      ],
      "category": "books"
    },
    "product-70": {
      "name": "HelloBaby No WiFi Baby Monitor 5\" Screen 30-Hour Battery Pan-Tilt-Zoom Video Upgrade with Camera and Audio, Night Vision, VOX, 2-Way Talk, 8 Lullabies and 1000ft Range, HB6550",
      "description": "Advanced baby monitor with 5\" screen, 30-hour battery, pan-tilt-zoom camera, night vision, and 2-way talk.",
      "brand": "HelloBaby",
      "tags": [
        "baby",
        "monitor",
        "camera",
        "night-vision"
      ],
      "category": "baby"
    },
    "product-71": {
      "name": "Babystar Baby Monitor with Camera and Audio, 720P HD Resolution 5\" Display, Up to 22 Hour Battery, Remote Pan-Tilt-Zoom, No WiFi, VOX, Night Vision, 2-Way Audio, Lullabies, Temperature Sensor",
      "description": "HD baby monitor with 720P resolution, 22-hour battery, pan-tilt-zoom, night vision, and temperature sensor.",
      "brand": "Babystar",
      "tags": [
        "baby",
        "monitor",
        "hd",
        "temperature-sensor"
      ],
      "category": "baby"
    },
    "product-72": {
      "name": "3 Pack Anti Breakage Baby Bottle Holder, Silicone Sleeves for Dr. Brown's Natural Glass Baby Bottles, Anti Flow Sleeve for Infant Bottles (5 Ounce)",
      "description": "3-pack silicone sleeves for Dr. Brown's glass baby bottles to prevent breakage and provide anti-flow protection.",
      "brand": "Generic",
      "tags": [
        "baby",
        "bottle",
        "silicone",
        "protection"
      ],
      "category": "baby"
    },
    "product-73": {
      "name": "GROWNSY Baby Food Maker with Steam Basket, One Step Baby Food Processor Steamer Puree Blender Grinder Mills Machine, Auto Cooking Grinding and Sterili-zing for Healthy Homemade Baby Food, BPA-Free",
      "description": "Complete baby food maker with steam basket, processor, steamer, and blender for healthy homemade baby food.",
      "brand": "GROWNSY",
      "tags": [
        "baby",
        "food-maker",
        "steamer",
        "blender"
      ],
      "category": "baby"
    },
    "product-74": {
      "name": "GROWNSY Baby Food Maker with Steam Basket, One Step Baby Food Processor Steamer Puree Blender Grinder Mills Machine, Auto Cooking Grinding and Sterili-zing for Healthy Homemade Baby Food, Dark Grey",
      "description": "Dark grey baby food maker with steam basket, processor, steamer, and blender for healthy homemade baby food.",
      "brand": "GROWNSY",
      "tags": [
        "baby",
        "food-maker",
        "dark-grey",
        "steamer"
      ],
      "category": "baby"
    },
    "product-75": {
      "name": "Huggies Size 3 Overnites Baby Diapers: Overnight Diapers, Size 3 (16-28 lbs), 132 Ct (2 Packs of 66), Packaging May Vary",
      "description": "Huggies overnight diapers size 3 for babies 16-28 lbs, 132 count in 2 packs of 66 for overnight protection.",
      "brand": "Huggies",
      "tags": [
        "baby",
        "diapers",
        "overnight",
        "size-3"
      ],
      "category": "baby"
    },
    "product-76": {
      "name": "Hostinger is a web hosting service provider that offers domain registration, email hosting, and a range of hosting options like shared, cloud, VPS, and WordPress hosting.",
      "description": "Professional web hosting service with domain registration, email hosting, shared hosting, cloud hosting, VPS, and WordPress hosting solutions.",
      "brand": "Hostinger",
      "tags": [
        "technology",
        "hosting",
        "web",
        "domain",
        "vps",
        "cloud"
      ],
      "category": "technology"
    },
    "product-77": {
      "name": "Brother XM2701 Sewing Machine, Lightweight, Full Featured, 27 Stitches, 6 Included Feet",
      "description": "Lightweight, full-featured sewing machine with 27 built-in stitches and 6 included feet for versatile sewing.",
      "brand": "Brother",
      "tags": [
        "home",
        "sewing-machine",
        "brother",
        "stitches"
      ],
      "category": "home"
    },
    "product-78": {
      "name": "Brother CS7000X Computerized Sewing and Quilting Machine, 70 Built-in Stitches, LCD Display, Wide Table, 10 Included Feet, White",
      "description": "Computerized sewing and quilting machine featuring 70 built-in stitches, LCD display, wide table, and 10 included feet.",
      "brand": "Brother",
      "tags": [
        "home",
        "sewing-machine",
        "brother",
        "computerized"
      ],
      "category": "home"
    },
    "product-79": {
      "name": "HP 15.6 inch Laptop, HD Touchscreen Display, AMD Ryzen 3 7320U, 8 GB RAM, 256 GB SSD, AMD Radeon Graphics, Windows 11 Home, Natural Silver, 15-fc0399nr",
      "description": "HP 15.6 inch laptop with HD touchscreen display, AMD Ryzen 3 7320U processor, 8GB RAM, 256GB SSD, and AMD Radeon graphics.",
      "brand": "HP",
      "tags": [
        "electronics",
        "laptop",
        "hp",
        "touchscreen",
        "amd-ryzen"
      ],
      "category": "electronics"
    },
    "product-80": {
      "name": "HP 17.3 inch Laptop, HD+ Display, AMD Ryzen 5 7520U, 16 GB RAM, 512 GB SSD, AMD Radeon Graphics, Windows 11 Home, Natural Silver, 17-cp2199nr",
      "description": "HP 17.3 inch laptop with HD+ display, AMD Ryzen 5 7520U processor, 16GB RAM, 512GB SSD, and AMD Radeon graphics.",
      "brand": "HP",
      "tags": [
        "electronics",
        "laptop",
        "hp",
        "amd-ryzen",
        "large-screen"
      ],
      "category": "electronics"
    },
    "product-81": {
      "name": "HP 17.3\" Laptop Computer • Intel 13th 8-Cores i3 CPU (Beat 11th i5) • 32GB RAM • 1TB SSD • 10-Key Number Pad • Win11 Pro • Lifetime Microsoft Office 365 for The Web • W/O Mouse",
      "description": "HP 17.3\" laptop with Intel 13th gen 8-core i3 CPU, 32GB RAM, 1TB SSD, 10-key number pad, Windows 11 Pro, and lifetime Microsoft Office 365.",
      "brand": "HP",
      "tags": [
        "electronics",
        "laptop",
        "hp",
        "intel-i3",
        "large-screen",
        "high-ram",
        "office-365"
      ],
      "category": "electronics"
    },
    "product-82": {
      "name": "Tapo TP-Link ColorPro Wi-Fi Outdoor Camera | Plug-in | Daylight Clarity at Night | 2K QHD | Person/Pet/Vehicle Detection | Local/Cloud Storage | 127° FOV | Built-in Siren C325WB",
      "description": "Tapo TP-Link ColorPro Wi-Fi outdoor camera with 2K QHD resolution, person/pet/vehicle detection, local/cloud storage, 127° FOV, and built-in siren.",
      "brand": "TP-Link",
      "tags": [
        "electronics",
        "security-camera",
        "tapo",
        "tp-link",
        "outdoor",
        "wifi",
        "2k-qhd"
      ],
      "category": "electronics"
    },
    "product-83": {
      "name": "Tapo by TP-Link Smart Video Doorbell Camera Wireless with Chime, 2K with Full Color Night Vision & Spotlights, No Monthly Fee, Ring Call, 160° Ultra-Wide View, Free AI Detection, Local Storage, D210",
      "description": "Tapo by TP-Link smart video doorbell camera wireless with chime, 2K resolution, full color night vision, spotlights, no monthly fee, and 160° ultra-wide view.",
      "brand": "TP-Link",
      "tags": [
        "electronics",
        "doorbell-camera",
        "tapo",
        "tp-link",
        "wireless",
        "2k",
        "night-vision"
      ],
      "category": "electronics"
    },
    "product-84": {
      "name": "Charger for MacBook Pro 16 14 inch MacBook Air 15 13 inch 2025 2024 2023 2022 2021 2020 2019 M4 M3 M2 M1, Super Compact 100W USB C Laptop Power Adapter, 6.6FT USB-C Braided Cable, Original Quality",
      "description": "Super compact 100W USB-C laptop power adapter compatible with MacBook Pro and MacBook Air models from 2019-2025, including M1, M2, M3, and M4 chips. Features 6.6FT braided cable and original quality construction.",
      "brand": "Generic",
      "tags": [
        "electronics",
        "charger",
        "macbook",
        "usb-c",
        "power-adapter",
        "laptop",
        "100w",
        "braided-cable"
      ],
      "category": "electronics"
    },
    "product-85": {
      "name": "Amazon Basics 68W Two-Port GaN Wall Charger with 2 USB-C Ports (60W, 18W) with PD for Laptops, Tablets & Phones (iPhone 16/15/14/13/12/11/X, iPad, MacPro, Samsung, and More), Non-PPS, Black",
      "description": "Amazon Basics 68W two-port GaN wall charger featuring 2 USB-C ports with Power Delivery (PD) technology. Compatible with laptops, tablets, and phones including iPhone 16/15/14/13/12/11/X, iPad, MacBook Pro, Samsung devices, and more. Features 60W and 18W power distribution.",
      "brand": "Amazon Basics",
      "tags": [
        "electronics",
        "charger",
        "gan",
        "usb-c",
        "power-delivery",
        "wall-charger",
        "two-port",
        "68w",
        "amazon-basics"
      ],
      "category": "electronics"
    },
    "product-86": {
      "name": "Mac AC Wall Adapter Plug Duckhead US Wall Charger AC Cord US Standard Duck Head for MacBook Mac iBook/iPhone/iPod Power Adapter Brick (2 PCs)",
      "description": "Mac AC wall adapter plug duckhead US wall charger with AC cord. US standard duck head compatible with MacBook, Mac, iBook, iPhone, and iPod power adapter bricks. Package includes 2 pieces for convenience.",
      "brand": "Generic",
      "tags": [
        "electronics",
        "adapter",
        "mac",
        "macbook",
        "iphone",
        "ipod",
        "power-adapter",
        "duckhead",
        "us-standard",
        "ac-cord"
      ],
      "category": "electronics"
    },
    "product-87": {
      "name": "Apple 2022 MacBook Air Laptop with M2 chip (13.6-inch, 8GB RAM, 256GB SSD Storage) Starlight (Renewed)",
      "description": "Apple 2022 MacBook Air laptop featuring the powerful M2 chip, 13.6-inch Liquid Retina display, 8GB unified memory, and 256GB SSD storage. Starlight color finish. This is a renewed (refurbished) model offering excellent value with Apple quality.",
      "brand": "Apple",
      "tags": [
        "electronics",
        "laptop",
        "macbook",
        "apple",
        "m2-chip",
        "renewed",
        "starlight",
        "13.6-inch",
        "8gb-ram",
        "256gb-ssd"
      ],
      "category": "electronics"
    },
    "product-88": {
      "name": "Coolby 15.6inch Laptop, 12GB RAM/256GB SSD, 1920x1080 IPS Display, Intel N95(Beats N5095) Quad Core Laptop Computer, Support Fingerprint, WiFi 5, BT",
      "description": "Coolby 15.6-inch laptop featuring Intel N95 quad-core processor (beats N5095), 12GB RAM, 256GB SSD storage, 1920x1080 IPS display, fingerprint support, WiFi 5, and Bluetooth connectivity. Perfect for productivity and entertainment.",
      "brand": "Coolby",
      "tags": [
        "electronics",
        "laptop",
        "coolby",
        "intel-n95",
        "12gb-ram",
        "256gb-ssd",
        "15.6-inch",
        "ips-display",
        "fingerprint",
        "wifi-5",
        "bluetooth"
      ],
      "category": "electronics"
    },
    "product-89": {
      "name": "AE86 15.6\" Laptop, Celeron N4000, 12GB RAM 256GB SSD, Full HD 1080P Display, Dual-Band WiFi, Mini HDMI, Lightweight Slim Silver Notebook for Business, School, Home",
      "description": "AE86 15.6-inch laptop featuring Intel Celeron N4000 processor, 12GB RAM, 256GB SSD storage, Full HD 1080P display, dual-band WiFi, mini HDMI port, and lightweight slim silver design. Perfect for business, school, and home use.",
      "brand": "AE86",
      "tags": [
        "electronics",
        "laptop",
        "ae86",
        "celeron-n4000",
        "12gb-ram",
        "256gb-ssd",
        "15.6-inch",
        "full-hd",
        "dual-band-wifi",
        "mini-hdmi",
        "lightweight",
        "silver"
      ],
      "category": "electronics"
    },
    "product-90": {
      "name": "Compatible for MacBook Air 13.6 inch Case M4 M3 M2 2025 2024-2022 Release Model A3240 A3113 A2681, Sturdy Protective Hard Shell Case Cover for MacBook Air M2 13 inch - Midnight Clear",
      "description": "Compatible protective hard shell case for MacBook Air 13.6 inch models M4, M3, M2 (2025, 2024-2022 release). Fits models A3240, A3113, A2681. Sturdy protective cover with midnight clear finish. Perfect fit and protection for your MacBook Air.",
      "brand": "Generic",
      "tags": [
        "electronics",
        "accessories",
        "macbook-air",
        "case",
        "protective",
        "hard-shell",
        "13.6-inch",
        "m4",
        "m3",
        "m2",
        "midnight-clear",
        "a3240",
        "a3113",
        "a2681"
      ],
      "category": "electronics"
    },
    "product-91": {
      "name": "SUPCASE for MacBook Air 13 Inch Case 2025-2022 (Unicorn Beetle), M4 A3240 / M3 A3113 / M2 A2681 Heavy Duty Rugged Shockproof Hard Shell Anti Scratch Protective Cover for MacBook Air 13.6\", Black",
      "description": "SUPCASE Unicorn Beetle heavy duty rugged shockproof hard shell case for MacBook Air 13 inch models 2025-2022. Compatible with M4 A3240, M3 A3113, M2 A2681. Anti-scratch protective cover with black finish. Maximum protection for your MacBook Air.",
      "brand": "SUPCASE",
      "tags": [
        "electronics",
        "accessories",
        "macbook-air",
        "case",
        "supcase",
        "unicorn-beetle",
        "heavy-duty",
        "rugged",
        "shockproof",
        "hard-shell",
        "anti-scratch",
        "13.6-inch",
        "m4",
        "m3",
        "m2",
        "black",
        "a3240",
        "a3113",
        "a2681"
      ],
      "category": "electronics"
    },
    "product-92": {
      "name": "CISSOOK Case Compatible with MacBook Air 13.6 Inch 2022 2024 2025 Release Model A2681 M2 A3113 M3 A3240 M4 Astronaut, Clear Black Space Hard Shell with Keyboard Cover for MacBook Air 13.6\", Astronaut",
      "description": "CISSOOK Astronaut case for MacBook Air 13.6 inch models 2022-2025. Compatible with A2681 M2, A3113 M3, A3240 M4. Clear black space hard shell with keyboard cover. Unique astronaut design with space theme. Perfect protection and style for your MacBook Air.",
      "brand": "CISSOOK",
      "tags": [
        "electronics",
        "accessories",
        "macbook-air",
        "case",
        "cissook",
        "astronaut",
        "clear-black",
        "space",
        "hard-shell",
        "keyboard-cover",
        "13.6-inch",
        "m4",
        "m3",
        "m2",
        "a2681",
        "a3113",
        "a3240"
      ],
      "category": "electronics"
    },
    "product-93": {
      "name": "Compatible for MacBook Air 13.6 inch Case M4 M3 M2 2025 2024-2022 Release Model A3240 A3113 A2681, Sturdy Protective Hard Shell Case Cover for MacBook Air M2 13 inch",
      "description": "Compatible protective hard shell case for MacBook Air 13.6 inch models M4, M3, M2 (2025, 2024-2022 release). Fits models A3240, A3113, A2681. Sturdy protective cover with precise fit. Perfect protection for your MacBook Air.",
      "brand": "Generic",
      "tags": [
        "electronics",
        "accessories",
        "macbook-air",
        "case",
        "protective",
        "hard-shell",
        "13.6-inch",
        "m4",
        "m3",
        "m2",
        "a3240",
        "a3113",
        "a2681",
        "sturdy"
      ],
      "category": "electronics"
    },
    "product-94": {
      "name": "F FORITO Magnetic Privacy Screen Protector Compatible with MacBook Air 13.6 inch (2022-2025, M2, M3, M4), 360° Anti Peeping Removable Anti Blue Light Anti Glare Laptop Privacy Screen Shield",
      "description": "F FORITO magnetic privacy screen protector for MacBook Air 13.6 inch models 2022-2025 (M2, M3, M4). Features 360° anti-peeping protection, removable magnetic design, anti-blue light, and anti-glare properties. Perfect privacy shield for your laptop.",
      "brand": "F FORITO",
      "tags": [
        "electronics",
        "accessories",
        "macbook-air",
        "privacy-screen",
        "magnetic",
        "anti-peeping",
        "anti-blue-light",
        "anti-glare",
        "13.6-inch",
        "m2",
        "m3",
        "m4",
        "removable",
        "360-degree"
      ],
      "category": "electronics"
    }
  }
}